Revit 2027 API
ImporterIFC Properties
The ImporterIFC type exposes the following members.
Properties
Name | Description
Document |  Gets the document associated with the import.
FullFileName |  The full file name of the IFC file to be import.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
See Also
Reference
ImporterIFC Class
Autodesk.Revit.DB.IFC Namespace